DataProcessors/ПолучениеАктуальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПолучениеАктуальныхОстатков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаписейСкладскогоЖурнала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GUID_Меркурий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМеркурий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаписиЖурнала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/КорректировкаОстатковЗаписейСкладскогоЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаОстатковЗаписейСкладскогоЖурнала</Name>
			<Comment>Корректировка остатков записей складского журнала</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаписейСкладскогоЖурнала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПолучениеАктуальныхОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументКорректировкиОстатковЗаписейСкладскогоЖурнала(Параметры, ТаблицаЗаписей) Экспорт
	
	ПараметрыПодключения = ИнтеграцияВетисAPIСлужебный.ПараметрыПодключенияКВетисAPI(Параметры.Организация, Параметры.Ответственный,, Справочники.ВидыОперацийОбменаAPI.ЗагрузкаДанныхПоЗаписямСкладскогоЖурнала);
	
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	ИтоговаяТаблица.Колонки.Добавить("ЗаписьСкладскогоЖурнала", Новый ОписаниеТипов("СправочникСсылка.СвойстваЗаписейСкладскогоЖурнала"));
	ИтоговаяТаблица.Колонки.Добавить("Количество"             , ОбщегоНазначения.ОписаниеТипаЧисло(21, 6));
	ИтоговаяТаблица.Колонки.Добавить("КоличествоОстаток"      , ОбщегоНазначения.ОписаниеТипаЧисло(21, 6));
	
	Для Каждого ТекЗапись Из ТаблицаЗаписей Цикл
		
		// Если количество одинаковое, то нет смысла делать по данной записи корректировку
		Если ТекЗапись.Количество = ТекЗапись.КоличествоМеркурий Тогда
			Продолжить;
		КонецЕсли;
		
		МассивОшибокОбработки = Новый Массив;
		
		Если ПустаяСтрока(ТекЗапись.ОписаниеОбъекта) Тогда // Такой записи нет в Меркурии, либо она уже списана в ноль
			
			НоваяСтрока = ИтоговаяТаблица.Добавить();
			НоваяСтрока.ЗаписьСкладскогоЖурнала = ТекЗапись.ЗаписьСкладскогоЖурнала;
			НоваяСтрока.Количество 				= ТекЗапись.КоличествоМеркурий;
			НоваяСтрока.КоличествоОстаток 		= ТекЗапись.Количество;
			
		Иначе
			
			ЗаписьСкладскогоЖурналаXDTO = ОбщегоНазначения.ОбъектXDTOИзСтрокиXML(ТекЗапись.ОписаниеОбъекта);
			ДанныеЗаписиСкладскогоЖурналаСтруктура = ИнтеграцияВетисAPIОбработкаПартий.ЗаписьСкладскогоЖурналаПоДаннымXDTO(ПараметрыПодключения, Параметры.Предприятие, ЗаписьСкладскогоЖурналаXDTO, Истина);
			
			НоваяСтрока = ИтоговаяТаблица.Добавить();
			НоваяСтрока.ЗаписьСкладскогоЖурнала = ДанныеЗаписиСкладскогоЖурналаСтруктура.ЗаписьСкладскогоЖурнала;
			НоваяСтрока.Количество              = ДанныеЗаписиСкладскогоЖурналаСтруктура.КоличествоПродукции;
			НоваяСтрока.КоличествоОстаток 		= ТекЗапись.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИтоговаяТаблица.Количество() > 0 Тогда
		
		ДокументКорректировки = Документы.КорректировкаОстатковЗаписейСкладскогоЖурнала.СоздатьДокумент();
		ДокументКорректировки.Дата = ТекущаяДата();
		ДокументКорректировки.УстановитьНовыйНомер();
		
		ДокументКорректировки.Организация   = Параметры.Организация;
		ДокументКорректировки.Контрагент    = Параметры.Контрагент;
		ДокументКорректировки.Предприятие   = Параметры.Предприятие;
		ДокументКорректировки.Ответственный = Параметры.Ответственный;
		
		ДокументКорректировки.ТаблицаЗаписейСкладскогоЖурнала.Загрузить(ИтоговаяТаблица);
		
		ДокументКорректировки.Записать();
		
		Если Не Параметры.Свойство("СсылкаНаДокумент") = Неопределено Тогда
			Параметры.СсылкаНаДокумент = ДокументКорректировки.Ссылка;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Создан документ: '") + ДокументКорректировки, ДокументКорректировки.Ссылка);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ не создан. Нет записей складского журнала различных по количеству.'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
